SUBOFFcyj/07_mesh_for_turb/0/U
 /*--------------------------------*- C++ -*----------------------------------*\
   =========                 |
   \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
    \\    /   O peration     | Website:  https://openfoam.org
     \\  /    A nd           | Version:  v2312
      \\/     M anipulation  |
 \*---------------------------------------------------------------------------*/
 FoamFile
 {
     version     2.0;
     format      ascii;
     class       volVectorField;
     location    "0";
     object      U;
 }
 // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
  
 dimensions      [0 1 -1 0 0 0 0];
  

 internalField   uniform (  1.649194 0.0  0.0 );
  
 boundaryField
 {
     INLET
     {
         type            timeVaryingMappedFixedValue;
         offset          ( 0 0 0 );
         setAverage      off;
     }
     OUTLET
     {
         type            symmetry;
     }
     HULL
     {
         type            inletOutlet;
         inletValue      uniform (0 0 0);
         value           uniform (  1.649194  0.0  0.0 );
     }
 }
