SUBOFFcyj/07_mesh_for_turb/0/p
 /*--------------------------------*- C++ -*----------------------------------*\
   =========                 |
   \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
    \\    /   O peration     | Website:  https://openfoam.org
     \\  /    A nd           | Version:  8
      \\/     M anipulation  |
 \*---------------------------------------------------------------------------*/
 FoamFile
 {
     version     2.0;
     format      ascii;
     class       volScalarField;
     location    "0";
     object      p;
 }
 // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
  
 dimensions      [0 2 -2 0 0 0 0];
  
 internalField   uniform 0;
  
 boundaryField
 {
     INLET
     {
         type            zeroGradient;
     }
     OUTLET
     {
         type            symmetry;
     }
     HULL
     {
         type            fixedValue;
        value           uniform 0;
     }
 }
