SUBOFFcyj/07_mesh_for_turb/constant/manualDecomposition_code/run.sh
#!/bin/bash
rm -rf *.e *.o 
make          
./file_out_manualDecomposition.e   
rm -rf *.e *.o
