SUBOFFcyj/07_mesh_for_turb/system/Q
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Calculate Q (from U)
Q
{
    libs ("libfieldFunctionObjects.so");

    type Q;

    // Output every
    writeControl writeTime;
}


// ************************************************************************* //
