SUBOFFcyj/07_mesh_for_turb/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

lx 3;
r 300;
nx 3;
n 160;


vertices
(
    (0 $r 0)
	($lx $r 0)
	($lx $r $r)
	(0 $r $r)
	(0 0 0)
	($lx 0 0)
	($lx 0 $r)
	(0 0 $r)
);

blocks
(
    hex (0   1  2  3  4  5  6  7) ($nx $n $n) (1.0 1.0 1.0)
);

edges
(
);

boundary
(

    INLET
    {
        type patch;
        faces
        (
            (3 0 4 7)
        );
    }

    OUTLET
    {
        type symmetry;
        faces
        (
            (1 0 3 2)
			(2 3 7 6)
			(6 7 4 5)
			(5 4 0 1)
        );
    }

    HULL
    {
        type patch;
        faces
        (
            (6 5 1 2)
        );
    }


);

mergePatchPairs
(
);

// ************************************************************************* //
