SUBOFFcyj/07_mesh_for_turb/system/controlDict
 /*--------------------------------*- C++ -*----------------------------------*\
   =========                 |
   \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
    \\    /   O peration     | Website:  https://openfoam.org
     \\  /    A nd           | Version:  v2312
      \\/     M anipulation  |
 \*---------------------------------------------------------------------------*/
 FoamFile
 {
     version     2.0;
     format      ascii;
     class       dictionary;
     object      controlDict;
 }
 // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 application     pimpleFoam;
 startFrom       startTime;
 startTime       0;
 stopAt          endTime;
 endTime         1.000001;
 deltaT          2e-4;
 writeControl    timeStep;
 writeInterval   1000;
 purgeWrite      0;
 writeFormat     ascii;
 writePrecision  14;
 writeCompression off;
 timeFormat      general;
 timePrecision   6;
 runTimeModifiable true;
 functions
 {
    //  #includeFunc Q
     #include "FOcomponents"
     #include "mass_flow_cal"
//      probes1_single
//      {
//          type            probes;
//          libs            ("libsampling.so");
//          writeControl    timeStep;
//          writeInterval   1;
//          timeStart      0;
//          timeEnd        1000000;
//          fields
//          (
//              p  Ux Uy Uz divU
//           );
//          probeLocations
//          (
// ( -0.22899742820135E+00  0.47110275326590E-03 -0.47110275326591E-03 )
//           );
//      }
     probes1
     {
         type            probes;
         libs            ("libsampling.so");
         writeControl    timeStep;
         writeInterval   1;
         timeStart      0;
         timeEnd        1000000;
         fields
         (
             p Ux Uy Uz
          );
         probeLocations
         (
         #include     "probesInletShift.c"
          );
     }
     probes2
     {
         type            probes;
         libs            ("libsampling.so");
         writeControl    timeStep;
         writeInterval   1;
         timeStart      0;
         timeEnd        1000000;
         fields
         (
             p Ux Uy Uz
          );
         probeLocations
         (
         #include     "probesInletShiftCenterLine.c"
          );
     }
 }
  
 // ************************************************************************* //
