SUBOFFcyj/07_mesh_for_turb/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 64;

// method          manual;
//method          hierarchical;
//preservePatches (FRONT BACK);
method          scotch;

hierarchicalCoeffs
{
    n               (1 10 10);
    delta           0.001;
    order           xyz;
}

manualCoeffs
{
    dataFile    "manualDecomposition";
}



// ************************************************************************* //
