SUBOFFcyj/07_mesh_for_turb/system/hull_probes_out_of/run.sh
#!/bin/bash
rm -rf *.e *.o 
make          
./cylinder.e   
rm -rf *.e *.o
